In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
d={'name':['hari','srikanth','mahi','arun','arul','shivani'],'age':[27,30,24,24,25,27],'gender':['m','m','m','m','m','m']}

In [4]:
df1 = pd.DataFrame(d)

In [5]:
df1

       name  age gender
0      hari   27      m
1  srikanth   30      m
2      mahi   24      m
3      arun   24      m
4      arul   25      m
5   shivani   27      m

In [6]:
df1['gender']

0    m
1    m
2    m
3    m
4    m
5    m
Name: gender, dtype: object

In [7]:
df1['salary']=[322332,43556,67889,56789,789000,89000]

In [8]:
df1['sal']=[34556.0,67899.0,56788.0,5677.0,890990.0,78990.0]

In [9]:
df1

       name  age gender  salary       sal
0      hari   27      m  322332   34556.0
1  srikanth   30      m   43556   67899.0
2      mahi   24      m   67889   56788.0
3      arun   24      m   56789    5677.0
4      arul   25      m  789000  890990.0
5   shivani   27      m   89000   78990.0

In [13]:
df1 = df1.drop(['sal'])

KeyError: "['sal'] not found in axis"

In [14]:
df1

       name  age gender  salary       sal
0      hari   27      m  322332   34556.0
1  srikanth   30      m   43556   67899.0
2      mahi   24      m   67889   56788.0
3      arun   24      m   56789    5677.0
4      arul   25      m  789000  890990.0
5   shivani   27      m   89000   78990.0

In [24]:
df1 = df1.drop(['sal'],axis = 5)

ValueError: No axis named 5 for object type DataFrame

In [25]:
df1.drop(4)

       name  age gender  salary      sal
0      hari   27      m  322332  34556.0
1  srikanth   30      m   43556  67899.0
2      mahi   24      m   67889  56788.0
3      arun   24      m   56789   5677.0
5   shivani   27      m   89000  78990.0

In [27]:
df1.loc[6] = ['saumya',34,'M',23457,34567.0]

In [28]:
df1

       name  age gender  salary       sal
0      hari   27      m  322332   34556.0
1  srikanth   30      m   43556   67899.0
2      mahi   24      m   67889   56788.0
3      arun   24      m   56789    5677.0
4      arul   25      m  789000  890990.0
5   shivani   27      m   89000   78990.0
6    saumya   34      M   23457   34567.0

In [29]:
df1.loc[7] = ['susender',34,'M',324566,36790.0]

In [30]:
df1

       name  age gender  salary       sal
0      hari   27      m  322332   34556.0
1  srikanth   30      m   43556   67899.0
2      mahi   24      m   67889   56788.0
3      arun   24      m   56789    5677.0
4      arul   25      m  789000  890990.0
5   shivani   27      m   89000   78990.0
6    saumya   34      M   23457   34567.0
7  susender   34      M  324566   36790.0

In [31]:
df1.iloc[2:3,3:4]

   salary
2   67889

In [32]:
df1.isnull().any()

name      False
age       False
gender    False
salary    False
sal       False
dtype: bool

In [33]:
df1.isnull().sum()

name      0
age       0
gender    0
salary    0
sal       0
dtype: int64

In [34]:
df1.head()

       name  age gender  salary       sal
0      hari   27      m  322332   34556.0
1  srikanth   30      m   43556   67899.0
2      mahi   24      m   67889   56788.0
3      arun   24      m   56789    5677.0
4      arul   25      m  789000  890990.0

In [35]:
df1['salary'].median()

78444.5

In [36]:
df1['salary'].mode()[0]

23457

In [37]:
df1['gender'].mode()[0]

'm'

In [38]:
df1

       name  age gender  salary       sal
0      hari   27      m  322332   34556.0
1  srikanth   30      m   43556   67899.0
2      mahi   24      m   67889   56788.0
3      arun   24      m   56789    5677.0
4      arul   25      m  789000  890990.0
5   shivani   27      m   89000   78990.0
6    saumya   34      M   23457   34567.0
7  susender   34      M  324566   36790.0

In [39]:
df1.loc[8]=['susender',32,'M',567890,9000.0]

In [40]:
df1

       name  age gender  salary       sal
0      hari   27      m  322332   34556.0
1  srikanth   30      m   43556   67899.0
2      mahi   24      m   67889   56788.0
3      arun   24      m   56789    5677.0
4      arul   25      m  789000  890990.0
5   shivani   27      m   89000   78990.0
6    saumya   34      M   23457   34567.0
7  susender   34      M  324566   36790.0
8  susender   32      M  567890    9000.0

In [42]:
df1 = df1.drop_duplicates('susender')

KeyError: Index(['susender'], dtype='object')

In [43]:
df1['name']

0        hari
1    srikanth
2        mahi
3        arun
4        arul
5     shivani
6      saumya
7    susender
8    susender
Name: name, dtype: object

In [44]:
df1['gender'].unique()

array(['m', 'M'], dtype=object)

In [45]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    9 non-null      object
 1   age     9 non-null      int64
 2   gender  9 non-null      object
 3   salary  9 non-null      int64
 4   sal     9 non-null      float64
dtypes: float64(1), int64(2), object(2)
memory usage: 432.0+ bytes

In [46]:
df1['gender']

0    m
1    m
2    m
3    m
4    m
5    m
6    M
7    M
8    M
Name: gender, dtype: object

In [47]:
sns.boxplot(df1['salary'])

NameError: name 'sns' is not defined

In [49]:
df1.describe()

             age         salary            sal
count   9.000000       9.000000       9.000000
mean   28.555556  253831.000000  135028.555556
std     4.065437  272165.329455  284538.899155
min    24.000000   23457.000000    5677.000000
25%    25.000000   56789.000000   34556.000000
50%    27.000000   89000.000000   36790.000000
75%    32.000000  324566.000000   67899.000000
max    34.000000  789000.000000  890990.000000